export default function About() {
  return (
    <main className="bg-gray-100 min-h-screen">
      <div className="container mx-auto px-4 py-16">
        <h1 className="text-4xl font-bold text-center mb-12">Про нас</h1>

        <div className="bg-white p-8 rounded-lg shadow-md mb-8">
          <h2 className="text-2xl font-semibold mb-4">Наша місія</h2>
          <p className="text-gray-700">
            В YouLearn наша місія - надавати можливість людям завдяки
            інноваційним освітнім програмам, революціонізувати технічну
            індустрію за допомогою передових рішень, створювати стійкі та
            екологічні продукти, які покращують повсякденне життя. Ми віримо в
            такі основні цінності, як інновації, чесність та інклюзивність і
            прагнемо зробити позитивний вплив на наше співтовариство та світ.
          </p>
        </div>

        <div className="bg-white p-8 rounded-lg shadow-md mb-8">
          <h2 className="text-2xl font-semibold mb-4">Хто ми є</h2>
          <p className="text-gray-700">
            Заснована у 2024 році, YouLearn виросла з невеликого стартапу в
            провідного постачальника освітніх ресурсів, надійного партнера для
            технічних рішень та піонера в галузі стійких продуктів. Наша команда
            пристрасних професіоналів прагне розробляти високоякісні курси,
            створювати зручне програмне забезпечення та проектувати екологічні
            продукти, які задовольняють потреби наших різноманітних клієнтів.
          </p>
        </div>

        <div className="bg-white p-8 rounded-lg shadow-md mb-8">
          <h2 className="text-2xl font-semibold mb-4">Що ми робимо</h2>
          <p className="text-gray-700 mb-4">
            Ми спеціалізуємося на онлайн-освіті. Наші пропозиції включають:
          </p>
          <ul className="list-disc list-inside text-gray-700 mb-4">
            <li>Короткий опис продукту та його переваг.</li>
            <li>Короткий опис продукту та його переваг.</li>
            <li>Короткий опис продукту та його переваг.</li>
            <li>Короткий опис продукту та його переваг.</li>
          </ul>
          <p className="text-gray-700">
            Кожен наш продукт або послуга створені з урахуванням потреб
            користувача, забезпечуючи легкість використання, ефективність,
            доступність та стійкість.
          </p>
        </div>

        <div className="bg-white p-8 rounded-lg shadow-md mb-8">
          <h2 className="text-2xl font-semibold mb-4">Приєднуйтесь до нас</h2>
          <p className="text-gray-700">
            Чи ви студент, бізнес чи еко-свідомий споживач, ми запрошуємо вас
            ознайомитися з нашими пропозиціями та приєднатися до нашої місії
            [вставте вашу місію]. Разом ми можемо змінити майбутнє освіти,
            просувати технологічні інновації та створювати зелений планету.
          </p>
        </div>

        <div className="bg-white p-8 rounded-lg shadow-md mb-8">
          <p className="text-gray-700">
            Дякуємо, що стали частиною нашої подорожі.
          </p>
        </div>

        <div className="bg-white p-8 rounded-lg shadow-md">
          <p className="text-gray-700">
            Для отримання додаткової інформації, будь ласка, зв'яжіться з нами
            або стежте за нами в соціальних мережах.
          </p>
        </div>
      </div>
    </main>
  );
}
